{
  "header": {
    "nav": {
      "close_menu": "Close",
      "welcome": "Welcome",
      "about_me": "About me",
      "my_skills": "Skills",
      "my_projects": "Projects",
      "contact_me": "Contact",
      "blog": "Blog",
      "my_birthday": "Birthday",
      "portfolio": "Portfólio"
    }
  },
  "footer": {
    "copy": "All rights reserved",
    "dev": "Developed by"
  },
  "home": {
    "meta_infos": {
      "name": "Pedro Henrique's portfolio",
      "title": "Pedro Henrique | Fullstack developer | Frontend | Backend",
      "desc": "I'm a Fullstack, backend and frontend Developer. Here you can find my projects, resume and contact information. Enjoy! :)"
    },
    "presentation": {
      "title": "Hello, my\nname's Pedro Henrique.\nI'm a fullstack\ndeveloper.",
      "scroll_down": "scroll down"
    },
    "about_me": {
      "title": "About me",
      "paragraphs": {
        "0": "I'm a junior Fullstack programmer with experience in Typescript, React, React Native, Expo, NextJs, Postgres, Redis, Express and other technologies. I constantly seek to improve my skills to face challenges in innovative projects. I'm a Computer Science student at UFG.",
        "1": "I am looking for opportunities that allow me to apply these skills in a practical way, contributing effectively to collaborative teams. I am excited to participate in the development of exciting projects and contribute to effective solutions.",
        "2": "In addition to my professional interest, I enjoy music, games and reading, which contribute to my creative approach to problem solving."
      },
      "skills_list": [
        "English intermediary",
        "Javascript/Typescript (ES6) and Python",
        "Web development (HTML/CSS, React and NextJS)",
        "Mobile development (React Native, Firebase and Expo)",
        "Backend development (NodeJS)",
        "API development (Express, Typeorm, Socket.io)",
        "PostgresSQL, MongoDB and Redis"
      ]
    },
    "my_skills": {
      "title": "Skills"
    },
    "my_projects": {
      "title": "Featured Projects",
      "subtitle": "I am responsible for the integral development of all projects, from design to code implementation. Although these projects are personal, I am actively searching opportunities to be involved in professional work. To access my projects, I invite you to visit my full profile on <link>Github</link>.",
      "projects": {
        "github_button": "View on Github",
        "portfolio": {
          "name": "Portfolio",
          "description": "I present my new portfolio, marked by modernity and innovation. With the addition of a personal blog and a countdown to my birthday, accompanied by an exclusive congratulatory wall, this project stands out as a significant milestone in my professional journey."
        },
        "saturn_chat": {
          "name": "Saturn Chat",
          "description": "This ongoing project is my most significant initiative to date. A messaging app for mobile devices, simplifying WhatsApp and Discord features in a more intuitive way. It stands out for its advanced system of invitations, roles system, sending files and voice messages."
        },
        "saturn_chat_api": {
          "name": "Saturn Chat API",
          "description": "This API is the operational basis of Saturn Chat. It uses Express, the PostgresSQL database (accessed via TypeORM) and stands out for its advanced websockets system. This system facilitates real-time transmission of events between the application and the API, optimized with Redis for caching."
        },
        "green_force": {
          "name": "Green Force",
          "description": "A website created with the purpose of promoting afforestation as a measure to mitigate global warming, this represents one of the first projects I developed. It constitutes a significant showcase of my transition to the position of Fullstack developer."
        },
        "soundify": {
          "name": "Soundify",
          "description": "A mobile music app designed to enhance playback of locally stored tracks. Offering features such as background playback, a dynamic player with automatic color selection for the layout, and an automatic song listing functionality on the device."
        }
      }
    },
    "contact": {
      "title": "Contact Me",
      "subtitle": "I am available to discuss additional information, job opportunities and freelance projects. Please contact me for more detailed conversation.",
      "dm_ig": "Contact me in Instagram DM"
    },
    "call_to_blog": {
      "title": "Hey, visit my blog!",
      "subtitle": "Read my tech posts, daily development, details of my projects and more. Every week have new posts!",
      "access_blog": "Access blog"
    }
  },
  "blog": {
    "meta_infos": {
      "name": "Pedro Henrique's blog",
      "title": "Blog posts | Pedro Henrique",
      "desc": "Read the posts of my blogs. Here you find the better content about programming, tech and news of WWW."
    },
    "presentation": {
      "title": "Read my blog!",
      "subtitle": "All posts are write by me for people of world. Posts are in pt-BR (English not available in the moment)."
    },
    "post_list": {
      "title": "{amount} Posts",
      "reading_time": "Approximately {readingTime} minutes"
    },
    "post": {
      "reading_time": "Approximately {readingTime} minutes",
      "back": "Back to posts"
    }
  },
  "my_birthday": {
    "meta_infos": {
      "name": "Pedro Henrique's birthday",
      "title": "Countdown to my birthday 🎉 | Pedro Henrique",
      "desc": "See my birthday countdown! She is updated in realtime and also give access to my Birthday Mural."
    },
    "countdown": {
      "calc": "Calculating...",
      "missing_time": "Exactly missing",
      "years_old_text": "for my <bold>{yearsOld}<sup>th</sup> birthday</bold>"
    },
    "birthday": {
      "title": "🎉 Today is my birthday 🎉",
      "subtitle": "How about leaving a message for me?",
      "buttons": {
        "instagram": "Send a message in Instagram",
        "new_in_mural": "Send a message in Mural",
        "show_mural": "Show Mural messages"
      }
    }
  },
  "new_mural_post": {
    "meta_infos": {
      "name": "Pedro Henrique's Birthday Mural",
      "title": "New message to birthday mural | Pedro Henrique",
      "desc": "Send a new message for my birthday mural. This message will stay in mural by 1 year."
    },
    "presentation": {
      "title": "Send your message for me!!",
      "subtitle": "Your message will show on Birthday Mural"
    }
  },
  "mural_posts": {
    "meta_infos": {
      "name": "Pedro Henrique's Birthday Mural",
      "title": "Birthday mural | Pedro Henrique",
      "desc": "Look all messages sended on my last birthday. In birthday, new messages can be send."
    },
    "presentation": {
      "title": "Birthday Mural",
      "subtitle": "See messages that were sent on my birthday (all messages are deleted on 04/13 at 11:50PM)"
    },
    "posts": {
      "title": "{amount} Messages received"
    },
    "post": {
      "by": "by"
    }
  }
}
